Repository: miel-uqac/XR-Godot
Catalog: qdvrtour/tours/locale/*.po
Languages: fr

source: BACK
fr: PRÉCÉDENT

source: NEXT
fr: SUIVANT

source: END TOUR AND CONTINUE LEARNING
fr: TERMINER LE TUTORIEL

source: Close the tour?
fr: Fermer le tutoriel ?

source: Your progress will be lost.
fr: Votre progression sera perdue.

source: [u]Help[u]
fr: [u]Aide[u]

source: [right][u]Skip[/u][/right]
fr: [right][u]Passer[/u][/right]

source: SKIP STEP
fr: PASSER L'ÉTAPE

source: TRY AGAIN
fr: RÉESSAYER

source: It seems you're not done with this step! [color=#FF8A00]You may get stuck later on in the Tour if you skip ahead without completing all the tasks.[/color] You can try going back one step before skipping. If you decide to skip the step, note down the tasks and do them before you start the following steps.
fr: Il semble que vous n'avez pas terminé cette étape ! [color=#FF8A00]Vous pourriez rencontrer des problèmes plus tard dans le tutoriel si vous continuez sans avoir terminé toutes les tâches.[/color] Vous pouvez revenir à l'étape précédente avant de passer. Si vous décidez de sauter cette étape, notez les tâches à faire avant de continuer.

source: Welcome to Godot Tour!
fr: Bienvenue dans le tutoriel Godot !

source: START LEARNING
fr: COMMENCER LE TUTORIEL

source: NO
fr: NON

source: YES
fr: OUI

source: [center][b]Welcome to Godot![/b][/center]
fr: [center][b]Bienvenue dans Godot ![/b][/center]

source: [center]In this tutorial, you will discover the [b]Godot editor[/b] and its main features.[/center]
fr: [center]Dans ce tutoriel, vous allez découvrir [b]l'éditeur Godot[/b] et ses principales fonctionnalités.[/center]

source: [center]You will modify an existing project to learn how it works.[/center]
fr: [center]Vous allez modifier un projet existant pour apprendre comment il fonctionne.[/center]

source: [center][b]Let's get started![/b][/center]
fr: [center][b]C'est parti ![/b][/center]

source: Try the game
fr: Essayez le jeu

source: Click the Run button %s at the top right of the editor to launch the project.
fr: Cliquez sur le bouton Lancer %s en haut à droite de l'éditeur pour démarrer le projet.

source: To stop the game:
fr: Pour arrêter le jeu :

source: -On Windows: Press [b]%s[/b] or close the game window.
fr: -Sur Windows : Appuyez sur [b]%s[/b] ou fermez la fenêtre du jeu.

source: -On Headset: Press the Meta button and close the game window.
fr: -Dans le casque VR : Appuyez sur le bouton Meta et fermez la fenêtre du jeu.

source: Let's add a marble
fr: Ajoutons une bille

source: In this tutorial, you will modify a project containing a marble track. Here's what we'll do:
fr: Dans ce tutoriel, vous allez modifier un projet qui contient un circuit de billes. Voici ce que nous allons faire :

source: 1. Add a marble to the scene
fr: 1. Ajouter une bille à la scène

source: 2. Add collision physics to the marble
fr: 2. Ajouter des collisions physiques à la bille

source: 3. Learn GDScript basics by changing the marble's color based on its speed
fr: 3. Apprendre les bases du GDScript en changeant la couleur de la bille selon sa vitesse

source: Understanding the viewport
fr: Comprendre le viewport

source: The center of the editor shows the viewport. This is where you can see and edit the current [b]scene[/b].
fr: Le centre de l'éditeur affiche le viewport. C'est ici que vous pouvez voir et modifier la [b]scène[/b] actuelle.

source: Understanding the scene tree
fr: Comprendre l'arborescence de scène

source: On the left side of the editor, you'll find the Scene panel. It displays all objects in the current scene.
fr: Sur le côté gauche de l'éditeur, vous trouverez le panneau Scène. Il affiche tous les objets présents dans la scène actuelle.

source: Objects are organized in a tree structure. Each node (object) has a specific role and responsibility.
fr: Les objets sont organisés en structure d'arbre. Chaque nœud (objet) a un rôle et une responsabilité spécifiques.

source: Adding the marble to the scene
fr: Ajouter la bille à la scène

source: The marble object [i]Bille.tscn[/i] already exists. Let's add it to our main scene [i]main.tscn[/i].
fr: L'objet bille [i]Bille.tscn[/i] existe déjà. Ajoutons-le à notre scène principale [i]main.tscn[/i].

source: Follow these steps: 1. Click on the [b]Circuit[/b] node in the scene tree 2. Click the [b]Instantiate Child Scene[/b] button %s 3. Select the marble scene in the file browser
fr: Suivez ces étapes : 1. Cliquez sur le nœud [b]Circuit[/b] dans l'arborescence 2. Cliquez sur le bouton [b]Instancier une scène enfant[/b] %s 3. Sélectionnez la scène de la bille dans le navigateur de fichiers

source: Instantiate the [b]%s[/b] scene as a child of [b]%s[/b]
fr: Instancier la scène [b]%s[/b] en tant qu'enfant de [b]%s[/b]

source: Press the [b]%s[/b] button.
fr: Appuyez sur le bouton [b]%s[/b]

source: Positioning the marble
fr: Positionner la bille

source: Now that the marble is in the scene tree, you can manipulate it in the viewport. Simply click on it to select it.
fr: Maintenant que la bille est dans l'arborescence, vous pouvez la manipuler dans le viewport. Cliquez simplement dessus pour la sélectionner.

source: Using the inspector for precise positioning
fr: Utiliser l'inspecteur pour un positionnement précis

source: For more precise control, you can enter position values manually in the Inspector panel.
fr: Pour un contrôle plus précis, vous pouvez entrer les valeurs de position manuellement dans le panneau Inspecteur.

source: Navigate to: [b]Node3D[/b] > [b]Transform[/b] > [b]Position[/b]
fr: Allez dans : [b]Node3D[/b] > [b]Transform[/b] > [b]Position[/b]

source: To place the marble at the top of the track, use this position:
fr: Pour placer la bille en haut du circuit, utilisez cette position :

source: Why you can't see the marble in-game (yet)
fr: Pourquoi vous ne voyez pas encore la bille dans le jeu

source: If you run the game now, you won't see the marble. Why? It falls through the ground during loading because it has no collision shape!
fr: Si vous lancez le jeu maintenant, vous ne verrez pas la bille. Pourquoi ? Elle traverse le sol pendant le chargement car elle n'a pas de forme de collision !

source: [b]Important: Without a collision shape, the marble will pass through the ground and disappear.[/b]
fr: [b]Important : Sans forme de collision, la bille traversera le sol et disparaîtra.[/b]

source: Adding collision physics
fr: Ajouter la physique de collision

source: To make the marble interact with the ground and other objects, we need to add a collision shape.
fr: Pour que la bille interagisse avec le sol et les autres objets, nous devons ajouter une forme de collision.

source: Understanding scene instances
fr: Comprendre les instances de scène

source: Look at the scene tree. Some nodes like [b]Bille[/b] and [b]Parcours[/b] have an [b]Open in Editor[/b] icon %s next to them.
fr: Regardez l'arborescence de scène. Certains nœuds comme [b]Bille[/b] et [b]Parcours[/b] ont une icône [b]Ouvrir dans l'éditeur[/b] %s à côté d'eux.

source: This icon means the node is an instanced scene. You can create complex scenes by combining multiple child scenes.
fr: Cette icône signifie que le nœud est une scène instanciée. Vous pouvez créer des scènes complexes en combinant plusieurs scènes enfants.

source: Click the [b]Open in Editor[/b] icon %s next to the [b]Bille[/b] node to open and edit the marble scene.
fr: Cliquez sur l'icône [b]Ouvrir dans l'éditeur[/b] %s à côté du nœud [b]Bille[/b] pour ouvrir et modifier la scène de la bille.

source: Open the [b]Bille[/b] scene.
fr: Ouvrez la scène [b]Bille[/b].

source: Adding the collision shape
fr: Ajouter la forme de collision

source: Follow these steps: 1. Click on the [b]CollisionShape3D[/b] node 2. Look at the [b]Shape[/b] property in the Inspector 3. Click on [b]<empty>[/b] to select a shape 4. Choose [b]SphereShape3D[/b]
fr: Suivez ces étapes : 1. Cliquez sur le nœud [b]CollisionShape3D[/b] 2. Regardez la propriété [b]Shape[/b] dans l'Inspecteur 3. Cliquez sur [b]<vide>[/b] pour sélectionner une forme 4. Choisissez [b]SphereShape3D[/b]

source: Add a [b]SphereShape3D[/b].
fr: Ajoutez une [b]SphereShape3D[/b].

source: Testing the marble
fr: Tester la bille

source: Run the game again. The marble now stays on the track and doesn't fall through anymore! However, you won't be able to grab it yet - we'll add that feature next.
fr: Relancez le jeu. La bille reste maintenant sur la piste et ne tombe plus au travers ! Cependant, vous ne pourrez pas encore la saisir - nous ajouterons cette fonctionnalité ensuite.

source: Adding color changes with code
fr: Ajouter des changements de couleur avec du code

source: A script has been written to change the marble's color based on its speed, but we forgot to attach it! Let's fix that.
fr: Un script a été écrit pour changer la couleur de la bille en fonction de sa vitesse, mais nous avons oublié de l'attacher ! Corrigeons cela.

source: Attaching a script
fr: Attacher un script

source: Follow these steps: 1. Click on the [b]Bille[/b] node 2. Click the [b]Attach Script[/b] button %s 3. In the dialog, browse to find [b]ColorChange.gd[/b] 4. The file path should be: [b]res://GameObjects/ColorChange.gd[/b] 5. Confirm your selection
fr: Suivez ces étapes : 1. Cliquez sur le nœud [b]Bille[/b] 2. Cliquez sur le bouton [b]Attacher un script[/b] %s 3. Dans la fenêtre, parcourez les fichiers pour trouver [b]ColorChange.gd[/b] 4. Le chemin du fichier devrait être : [b]res://GameObjects/ColorChange.gd[/b] 5. Confirmez votre sélection

source: Attach the ColorChange script.
fr: Attachez le script ColorChange.

source: Opening the script
fr: Ouvrir le script

source: Notice that [b]Bille[/b] now has an [b]Open Script[/b] icon %s next to its name. This indicates the node has an attached script.
fr: Remarquez que [b]Bille[/b] a maintenant une icône [b]Ouvrir le script[/b] %s à côté de son nom. Cela indique que le nœud a un script attaché.

source: This icon shows the node has an attached script.
fr: Cette icône indique que le nœud a un script attaché.

source: Click the [b]Open Script[/b] icon %s next to the [b]Bille[/b] node to view and edit the script we just attached.
fr: Cliquez sur l'icône [b]Ouvrir le script[/b] %s à côté du nœud [b]Bille[/b] pour voir et modifier le script que nous venons d'attacher.

source: Understanding the ColorChange class
fr: Comprendre la classe ColorChange

source: This class defines [b]ColorChange[/b], which extends [b]XRToolsPickable[/b]. This allows us to grab the marble in VR.
fr: Cette classe définit [b]ColorChange[/b], qui hérite de [b]XRToolsPickable[/b]. Cela nous permet de saisir la bille en réalité virtuelle.

source: The code is written in [b]GDScript[/b], an interpreted language with Python-like syntax.
fr: Le code est écrit en [b]GDScript[/b], un langage interprété avec une syntaxe similaire à Python.

source: Declaring color variables
fr: Déclarer les variables de couleur

source: Look at line 22. The color change is hardcoded. Let's improve this by using variables.
fr: Regardez la ligne 22. Le changement de couleur est codé en dur. Améliorons cela en utilisant des variables.

source: Here's an example of how to declare a [b]Color[/b] variable:
fr: Voici un exemple de déclaration d'une variable de type [b]Color[/b] :

source: [b]Task 1: Declare two color variables at the beginning of the script.[/b]
fr: [b]Tâche 1 : Déclarez deux variables de couleur au début du script.[/b]

source: [b]Task 2: Replace the hardcoded color values with your variables on line 22.[/b]
fr: [b]Tâche 2 : Remplacez les valeurs de couleur codées en dur par vos variables à la ligne 22.[/b]

source: Remember to save your changes: [b]File[/b] > [b]Save[/b]
fr: N'oubliez pas de sauvegarder vos modifications : [b]Fichier[/b] > [b]Enregistrer[/b]

source: Refreshing the editor
fr: Actualiser l'éditeur

source: To see your changes in the editor, you need to refresh the node.
fr: Pour voir vos modifications dans l'éditeur, vous devez actualiser le nœud.

source: Simply click on another node, then click back on the node you want to refresh.
fr: Cliquez simplement sur un autre nœud, puis recliquez sur le nœud que vous voulez actualiser.

source: Making colors editable in the Inspector
fr: Rendre les couleurs modifiables dans l'Inspecteur

source: Select the marble and look at the Inspector. The [b]Max Speed[/b] variable is visible, but your color variables are not. Let's fix this!
fr: Sélectionnez la bille et regardez l'Inspecteur. La variable [b]Max Speed[/b] est visible, mais vos variables de couleur ne le sont pas. Corrigeons cela !

source: Let's quickly fix that.
fr: Corrigeons rapidement cela.

source: Using the @export annotation
fr: Utiliser l'annotation @export

source: Look at the [b]Max Speed[/b] variable declaration. Notice it has [b]@export[/b] in front of it. This makes the variable editable in the Inspector.
fr: Regardez la déclaration de la variable [b]Max Speed[/b]. Remarquez qu'elle a [b]@export[/b] devant elle. Cela rend la variable modifiable dans l'Inspecteur.

source: [b]Task: Add @export in front of your color variables.[/b]
fr: [b]Tâche : Ajoutez @export devant vos variables de couleur.[/b]

source: You can now edit the colors directly from the Inspector!
fr: Vous pouvez maintenant modifier les couleurs directement depuis l'Inspecteur !

source: Testing your work
fr: Tester votre travail

source: Launch the game one last time. You should be able to grab the marble and see it change to the colors you defined!
fr: Lancez le jeu une dernière fois. Vous devriez pouvoir saisir la bille et la voir changer selon les couleurs que vous avez définies !

source: Troubleshooting: If your colors don't appear, return to the [b]main[/b] scene and check the variable values of the [b]Bille[/b] instance in the Inspector.
fr: Dépannage : Si vos couleurs n'apparaissent pas, retournez à la scène [b]main[/b] et vérifiez les valeurs des variables de l'instance [b]Bille[/b] dans l'Inspecteur.

source: What you've learned
fr: Ce que vous avez appris

source: You've learned how to navigate and identify key parts of the Godot interface.
fr: Vous avez appris à naviguer et identifier les éléments clés de l'interface Godot.

source: You now understand what scenes, nodes, and scripts are and how they work together.
fr: Vous comprenez maintenant ce que sont les scènes, les nœuds et les scripts, et comment ils fonctionnent ensemble.

source: You've successfully instanced a child scene, attached a script, and modified its code!
fr: Vous avez réussi à instancier une scène enfant, attacher un script et modifier son code !

source: [center][b]Congratulations![/b][/center]
fr: [center][b]Félicitations ![/b][/center]

source: [center]What did you think of this tutorial?[/center]
fr: [center]Qu'avez-vous pensé de ce tutoriel ?[/center]

source: [center]Feel free to continue experimenting on your own![/center]
fr: [center]N'hésitez pas à continuer d'expérimenter par vous-même ![/center]
